**import packages**

In [7]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

*pandas*
    
* is used for data frame or it is used for databases  
    
*matplotlib*

* is used for visualisation and graphs
   
*numpy*

* is used for mathematical operations

In [2]:
a=10
b=20
c = a+b
c

30

**create a  dataframe using list**

In [8]:
l1 = ['Anas','Mohammad','Ali','Abu-Turab','Abu-Talib']
pd.DataFrame(l1)

           0
0       Anas
1   Mohammad
2        Ali
3  Abu-Turab
4  Abu-Talib

**I want to change the index name**

In [9]:
l1 = ['Anas','Mohammad','Ali','Abu-Turab','Abu-Talib']
ids = ['.','.','.','.','.']
pd.DataFrame(l1,index=ids)

           0
.       Anas
.   Mohammad
.        Ali
.  Abu-Turab
.  Abu-Talib

**i want to change column name**

In [11]:
l1 = ['Anas','Mohammad','Ali','Abu-Turab','Abu-Talib']
col = ['Names']
pd.DataFrame(l1,columns=col)

       Names
0       Anas
1   Mohammad
2        Ali
3  Abu-Turab
4  Abu-Talib

**multiple columns**

In [12]:
names = ['Anas','Mohammad','Ali','Abu-Turab','Abu-Talib']
age = ['23','64','63','62','74']
gender = ['Male','Male','Male','Male','Male']
col = ['Names','Age',"Gender"]
df = pd.DataFrame(zip(names,age,gender),columns=col)
df

       Names Age Gender
0       Anas  23   Male
1   Mohammad  64   Male
2        Ali  63   Male
3  Abu-Turab  62   Male
4  Abu-Talib  74   Male

**Add a new column to alreay existing df**

- in above first we have taken 
- then create a data frame
- now we want to add new data based on requirements

In [13]:
city = ['Lucknow','Mecca','Mecca','Mecca','Mecca']
country = ['India','KSA','KSA','KSA','KSA']
df['city'] = city
df['country'] = country
df.to_csv('D:\data-files\data.csv')
df

       Names Age Gender     city country
0       Anas  23   Male  Lucknow   India
1   Mohammad  64   Male    Mecca     KSA
2        Ali  63   Male    Mecca     KSA
3  Abu-Turab  62   Male    Mecca     KSA
4  Abu-Talib  74   Male    Mecca     KSA

**update the column with new values**

In [14]:
names = ['Anas','Zubair','Khalid','Taufeeq','Haleem']
df['Names'] = names
df
df.to_csv('data.csv')

**create empty data frame and add the column**

In [15]:
data = pd.DataFrame()
data['Names']=['Rahil','Sahil','Kamil','Shagil']
data['Age']=[18,17,16,24]
data['city']=['Lko','Kanpur','Barabanki','Gonda']
data

    Names  Age       city
0   Rahil   18        Lko
1   Sahil   17     Kanpur
2   Kamil   16  Barabanki
3  Shagil   24      Gonda

**create a dataframe using dictionary**

In [16]:
d = {'Names':['Sahil','Kamil','Shagil'],
    'Age':[26,22,15],
     'city':['Lko','Lko','Lko']
    }
df = pd.DataFrame(d)
df.to_excel('data_excel.xlsx')

In [17]:
d = {'Name':'Anas',
    'Age':23}
pd.DataFrame(d,index=[1])

   Name  Age
1  Anas   23

**Saving DataFrame**

In [18]:
d = {'Names':['Sahil','Kamil','Shagil'],
    'Age':[26,22,15],
     'city':['Lko','Lko','Lko']
    }
df = pd.DataFrame(d)
df.to_excel('data_excel.xlsx')

**how to read data frame**

In [19]:
import pandas as pd

* in order to read the data
* filename.extension
* open(filename.ext).read()

In [20]:
pd.read_csv('data.csv')

   Unnamed: 0    Names  Age Gender     city country
0           0     Anas   23   Male  Lucknow   India
1           1   Zubair   64   Male    Mecca     KSA
2           2   Khalid   63   Male    Mecca     KSA
3           3  Taufeeq   62   Male    Mecca     KSA
4           4   Haleem   74   Male    Mecca     KSA

In [24]:
pd.read_excel('data_excel.xlsx')

   Unnamed: 0   Names  Age city
0           0   Sahil   26  Lko
1           1   Kamil   22  Lko
2           2  Shagil   15  Lko

In [33]:
data = pd.DataFrame()
data['Names']=['Rahil','Sahil','Kamil','Shagil']
data['Age']=[18,17,16,24]
data['city']=['Lko','Kanpur','Barabanki','Gonda']
data
data.to_csv('demo.csv', index=False)
data.to_excel('demo.xlsx',index = False)

In [32]:
pd.read_excel('demo.xlsx')

    Names  Age       city
0   Rahil   18        Lko
1   Sahil   17     Kanpur
2   Kamil   16  Barabanki
3  Shagil   24      Gonda

In [34]:
pd.read_csv('demo.csv')

    Names  Age       city
0   Rahil   18        Lko
1   Sahil   17     Kanpur
2   Kamil   16  Barabanki
3  Shagil   24      Gonda

In [35]:
data['marks'] = [90,96,50,44]
data

    Names  Age       city  marks
0   Rahil   18        Lko     90
1   Sahil   17     Kanpur     96
2   Kamil   16  Barabanki     50
3  Shagil   24      Gonda     44

**Drop the column**

In [43]:
data.drop(columns='marks') #drops the column but when run the data again data will restore

    Names  Age       city
0   Rahil   18        Lko
1   Sahil   17     Kanpur
2   Kamil   16  Barabanki
3  Shagil   24      Gonda

In [44]:
data.drop(index=0) #drops the index but when runs the var again data restores

    Names  Age       city  marks
1   Sahil   17     Kanpur     96
2   Kamil   16  Barabanki     50
3  Shagil   24      Gonda     44

In [38]:
data

    Names  Age       city  marks
0   Rahil   18        Lko     90
1   Sahil   17     Kanpur     96
2   Kamil   16  Barabanki     50
3  Shagil   24      Gonda     44

In [41]:
data.drop(columns = ['city','marks'])

    Names  Age
0   Rahil   18
1   Sahil   17
2   Kamil   16
3  Shagil   24

In [42]:
data

    Names  Age       city  marks
0   Rahil   18        Lko     90
1   Sahil   17     Kanpur     96
2   Kamil   16  Barabanki     50
3  Shagil   24      Gonda     44

In [45]:
data.drop('marks',axis=1)

    Names  Age       city
0   Rahil   18        Lko
1   Sahil   17     Kanpur
2   Kamil   16  Barabanki
3  Shagil   24      Gonda

In [46]:
data.drop('age')

KeyError: "['age'] not found in axis"

In [47]:
data.drop('marks',axis=0)

KeyError: "['marks'] not found in axis"

**inplace**

* when we do the operation the result output is not overwriting
* means the original data frame is same as it is
* in order to do this we need to use inplace argument
* by default inplace = False
* make inplace = True if you want overwrite the result

In [49]:
data = pd.DataFrame()
data['Names']=['Rahil','Sahil','Kamil','Shagil']
data['Age']=[18,17,16,24]
data['city']=['Lko','Kanpur','Barabanki','Gonda']
data['marks'] = [90,96,50,44]
data

    Names  Age       city  marks
0   Rahil   18        Lko     90
1   Sahil   17     Kanpur     96
2   Kamil   16  Barabanki     50
3  Shagil   24      Gonda     44

In [57]:
data.drop(index = 1, inplace=True)

In [58]:
data

    Names  Age       city  marks
2   Kamil   16  Barabanki     50
3  Shagil   24      Gonda     44

**rename the column**

In [59]:
data = pd.DataFrame()
data['Names']=['Rahil','Sahil','Kamil','Shagil']
data['Age']=[18,17,16,24]
data['city']=['Lko','Kanpur','Barabanki','Gonda']
data['marks'] = [90,96,50,44]
data

    Names  Age       city  marks
0   Rahil   18        Lko     90
1   Sahil   17     Kanpur     96
2   Kamil   16  Barabanki     50
3  Shagil   24      Gonda     44

In [63]:
data.rename({'city':'City'},axis=1)

    Names  Age       City  marks
0   Rahil   18        Lko     90
1   Sahil   17     Kanpur     96
2   Kamil   16  Barabanki     50
3  Shagil   24      Gonda     44

In [64]:
data

    Names  Age       city  marks
0   Rahil   18        Lko     90
1   Sahil   17     Kanpur     96
2   Kamil   16  Barabanki     50
3  Shagil   24      Gonda     44

In [66]:
data.rename(mapper={'Names':'names','Age':'age'},axis=1,inplace=True)

In [67]:
data

    names  age       city  marks
0   Rahil   18        Lko     90
1   Sahil   17     Kanpur     96
2   Kamil   16  Barabanki     50
3  Shagil   24      Gonda     44

**Task: 
create one dataframe
x=1 to 10
y = x square
z = x cube**

In [76]:
d1 = np.arange(1,11)
d2 = np.square(d1)
d3 = d1**3
data = {'x':d1,'y':d2,'z':d3}
df = pd.DataFrame(data)
df

    x    y     z
0   1    1     1
1   2    4     8
2   3    9    27
3   4   16    64
4   5   25   125
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

**methods**

* len
* shape
* size
* head
* tail
* isnull
* dtypes
* info

In [80]:
df.shape

(10, 3)

In [81]:
len(df)

10

In [82]:
df.size

30

In [84]:
df.head()

   x   y    z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125

In [85]:
df.tail()

    x    y     z
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000

In [87]:
df.isnull()

       x      y      z
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False
7  False  False  False
8  False  False  False
9  False  False  False

In [92]:
df.isnull().sum()

x    0
y    0
z    0
dtype: int64

In [89]:
df.dtypes

x    int64
y    int64
z    int64
dtype: object

In [91]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       10 non-null     int64
 1   y       10 non-null     int64
 2   z       10 non-null     int64
dtypes: int64(3)
memory usage: 372.0 bytes

In [106]:
print('length',len(df))
print('shape',df.shape)
print('size',df.size)
print('isnull',df.isnull())
print('head',df.head())
print('tail',df.tail())
print('info',df.info())
print('dtype',df.dtypes)

length 10
shape (10, 3)
size 30
isnull        x      y      z
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False  False
7  False  False  False
8  False  False  False
9  False  False  False
head    x   y    z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125
tail     x    y     z
5   6   36   216
6   7   49   343
7   8   64   512
8   9   81   729
9  10  100  1000
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   x       10 non-null     int64
 1   y       10 non-null     int64
 2   z       10 non-null     int64
dtypes: int64(3)
memory usage: 372.0 bytes
info None
dtype x    int64
y    int64
z    int64
dtype: object

**select a columns**

In [108]:
df.columns

Index(['x', 'y', 'z'], dtype='object')

In [113]:
df['x'] # it is a series no column names

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: x, dtype: int64

In [122]:
df['x'].values # selecting one particular column and extracting data

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [127]:
df['x'].values.tolist()

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [114]:
print(type(df['x']))

<class 'pandas.core.series.Series'>

In [111]:
df[['x','y']] # it is a data frame it have column names

    x    y
0   1    1
1   2    4
2   3    9
3   4   16
4   5   25
5   6   36
6   7   49
7   8   64
8   9   81
9  10  100

In [120]:
df[['x','y','z']].shape

(10, 3)

In [125]:
df[['x','y','z']].values #selecting more than one column and extracting the data

array([[   1,    1,    1],
       [   2,    4,    8],
       [   3,    9,   27],
       [   4,   16,   64],
       [   5,   25,  125],
       [   6,   36,  216],
       [   7,   49,  343],
       [   8,   64,  512],
       [   9,   81,  729],
       [  10,  100, 1000]])

In [126]:
df[['x','y','z']].values.tolist()

[[1, 1, 1],
 [2, 4, 8],
 [3, 9, 27],
 [4, 16, 64],
 [5, 25, 125],
 [6, 36, 216],
 [7, 49, 343],
 [8, 64, 512],
 [9, 81, 729],
 [10, 100, 1000]]